import config from '../../config.cjs';

const ping = async (m, sock) => {
  const prefix = config.PREFIX;
const cmd = m.body.startsWith(prefix) ? m.body.slice(prefix.length).split(' ')[0].toLowerCase() : '';
const text = m.body.slice(prefix.length + cmd.length).trim();

  if (cmd === "menu") {
    const start = new Date().getTime();
    await m.React('✌️');
    const end = new Date().getTime();
    const responseTime = (end - start) / 1000;

    const text = `╔═━━━━════───➳
┇ ʙᴏᴛ ɴᴀᴍᴇ: *ʜᴀɴs ᴍᴅ*
┇ ᴠᴇʀꜱɪᴏɴ: *7.1.0*     
┇ ᴅᴇᴠ: *ʜᴀɴsᴛᴢ-ᴛᴇᴄʜ*
╚══━━━════───➳ 

> *ℍ𝔸ℕ𝕊 𝕄𝔻 ℂ𝕆𝕄𝕄𝔸ℕ𝔻 𝕃𝕀𝕊𝕋*

 *HELLO 👋 ${m.pushName} 𝚃𝙷𝙸𝚂 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂 𝚆𝙸𝙻𝙻 𝙶𝚄𝙸𝙳𝙴 ʙʏ ʜᴀɴs ᴛᴢ✦
☆𝚈𝙾𝚄 𝙷𝙾𝚆 𝚃𝙾 𝚄𝚂𝙴 𝙷𝙰𝙽𝚂-𝙼𝙳*

╔═━━━━━━━━════─━━━━──➳
║ HI ${m.pushName} welcome 
╚══━━━━━━━════─━━━━──➳
 
╔═━━━━════───➳  
║         *𝕊𝕐𝕊𝕋𝔼𝕄*         
║  ❖☛𝙿𝚒𝚗𝚐
║  ❖☛𝙰𝚕𝚒𝚟𝚎
║  ❖☛𝙾𝚠𝚗𝚎𝚛
║  ❖☛𝙼𝚎𝚗𝚞
╚══━━━════───➳

╔═━━━━━━━━════─━━━━──➳
║𝕋ℍ𝕀𝕊 𝕀𝕊 ℍ𝔸ℕ𝕊-𝕄𝔻-ℕ𝔼𝕎-𝕌ℙ𝔻𝔸𝕋𝔼
╚══━━━━━━━════─━━━━──➳

╔═━━━━════───➳
║          *𝕆𝕎ℕ𝔼ℝ*          
║  ❖☛𝙹𝚘𝚒𝚗
║  ❖☛𝙻𝚎𝚊𝚟𝚎
║  ❖☛𝙱𝚕𝚘𝚌𝚔 
║  ❖☛𝚄𝚗𝚋𝚕𝚘𝚌𝚔
║  ❖☛𝚂𝚎𝚝𝚙𝚙𝚋𝚘𝚝
║  ❖☛𝙰𝚗𝚝𝚒𝚌𝚊𝚕𝚕
║  ❖☛𝚂𝚎𝚝𝚜𝚝𝚊𝚝𝚞𝚜
║  ❖☛𝚂𝚎𝚝𝚗𝚊𝚖𝚎𝚋𝚘𝚝
║  ❖☛𝙰𝚞𝚝𝚘𝚃𝚢𝚙𝚒𝚗𝚐
║  ❖☛𝙰𝚕𝚠𝚊𝚢𝚜𝙾𝚗𝚕𝚒𝚗𝚎
║  ❖☛𝙰𝚞𝚝𝚘𝚁𝚎𝚊𝚍
║  ❖☛𝚊𝚞𝚝𝚘𝚜𝚟𝚒𝚎𝚠
╚══━━━════───➳

╔═━━━━━━━━════─━━━━──➳
║ 𝕓𝕖𝕤𝕥 𝕓𝕠𝕥 𝕚𝕟 𝕥𝕙𝕖 𝕨𝕠𝕣𝕕 2025 😎
╚══━━━━━━━════─━━━━──➳

╔═━━━━════───➳
║           *𝔾ℙ𝕋*          
║  ❖☛𝙰𝚒
║  ❖☛𝙱𝚞𝚐
║  ❖☛𝚁𝚎𝚙𝚘𝚛𝚝
║  ❖☛𝙶𝚙𝚝
║  ❖☛𝙳𝚊𝚕𝚕𝚎
║  ❖☛𝚁𝚎𝚖𝚒𝚗𝚒
║  ❖☛𝙶𝚎𝚖𝚒𝚗𝚒
╚══━━━════───➳

╔═━━━━━━━━════─━━━━──➳
║  😎 𝕄𝔸𝔻𝔼 𝕀ℕ 𝕋𝔸ℕℤ𝔸ℕ𝕀𝔸 🇹🇿 
╚══━━━━━━━════─━━━━──➳
 
╔═━━━━════───➳
║       *ℂ𝕆ℕ𝕍𝔼ℝ𝕋𝔼ℝ*       
║  ❖☛𝙰𝚃𝚃𝙿
║  ❖☛𝙰𝚃𝚃𝙿2
║  ❖☛𝙰𝚃𝚃𝙿3
║  ❖☛𝙴𝙱𝙸𝙽𝙰𝚁𝚈
║  ❖☛𝙳𝙱𝙸𝙽𝙰𝚁𝚈
║  ❖☛𝙴𝙼𝙾𝙹𝙸𝙼𝙸𝚇
║  ❖☛𝙼𝙿3
║  ❖☛fancy
╚══━━━════───➳
╔═━━━━━━━━════─━━━━──➳
║  ✨ᴘᴏᴡᴇʀᴇᴅ ʙʏ ʜᴀɴs ᴛᴇᴄʜ✨
╚══━━━━━━━════─━━━━──➳
╔═━━━━════───➳
║          *𝔾ℝ𝕆𝕌ℙ*      
║  ❖☛𝙻𝚒𝚗𝚔𝙶𝚛𝚘𝚞𝚙
║  ❖☛𝚂𝚎𝚝𝚙𝚙𝚐𝚌
║  ❖☛𝚂𝚎𝚝𝚗𝚊𝚖𝚎
║  ❖☛𝚂𝚎𝚝𝚍𝚎𝚜𝚌
║  ❖☛𝙶𝚛𝚘𝚞𝚙
║  ❖☛𝙶𝚌𝚜𝚎𝚝𝚝𝚒𝚗𝚐
║  ❖☛𝚆𝚎𝚕𝚌𝚘𝚖𝚎
║  ❖☛𝙰𝚍𝚍
║  ❖☛𝙺𝚒𝚌𝚔
║  ❖☛𝙷𝚒𝚍𝚎𝚃𝚊𝚐
║  ❖☛𝚃𝚊𝚐𝚊𝚕𝚕
║  ❖☛𝙰𝚗𝚝𝚒𝙻𝚒𝚗𝚔
║  ❖☛𝙰𝚗𝚝𝚒𝚃𝚘𝚡𝚒𝚌
║  ❖☛𝙿𝚛𝚘𝚖𝚘𝚝𝚎
║  ❖☛𝙳𝚎𝚖𝚘𝚝𝚎
║  ❖☛𝙶𝚎𝚝𝚋𝚒𝚘
╚══━━━════───➳
╔═━━━━━━━━════─━━━━──➳
║  ⚡ℍ𝔸ℕ𝕊𝕋ℤ-𝕄𝔻 2024/2025⚡
╚══━━━━━━━════─━━━━──➳
╔═━━━━════───➳
║        *𝔻𝕆𝕎ℕ𝕃𝕆𝔸𝔻*      
║  ❖☛𝙰𝚙𝚔
║  ❖☛𝙵𝚊𝚌𝚎𝚋𝚘𝚘𝚔
║  ❖☛𝙼𝚎𝚍𝚒𝚊𝚏𝚒𝚛𝚎
║  ❖☛𝙿𝚒𝚗𝚝𝚎𝚛𝚎𝚜𝚝𝚍𝚕
║  ❖☛𝙶𝚒𝚝𝚌𝚕𝚘𝚗𝚎
║  ❖☛𝙶𝚍𝚛𝚒𝚟𝚎
║  ❖☛𝙸𝚗𝚜𝚝𝚊
║  ❖☛𝚈𝚝𝚖𝚙3
║  ❖☛𝚈𝚝𝚖𝚙4
║  ❖☛𝙿𝚕𝚊𝚢
║  ❖☛𝚂𝚘𝚗𝚐
║  ❖☛𝚅𝚒𝚍𝚎𝚘
║  ❖☛𝚈𝚝𝚖𝚙3𝚍𝚘𝚌
║  ❖☛𝚈𝚝𝚖𝚙4𝚍𝚘𝚌
║  ❖☛𝚃𝚒𝚔𝚝𝚘𝚔
╚══━━━════───➳
╔═━━━━━━━━════─━━━━──➳
║𝔻𝔼ℙ𝕃𝕆𝕐 𝔽𝕆ℝ 𝔽ℝ𝔼𝔼 𝕆ℕ ℝ𝔼ℕ𝔻𝔼ℝ
╚══━━━━━━━════─━━━━──➳
╔═━━━━════───➳
║         *𝕊𝔼𝔸ℝℂℍ*        
║  ❖☛𝙿𝚕𝚊𝚢
║  ❖☛𝚈𝚝𝚜
║  ❖☛𝙸𝚖𝚍𝚋
║  ❖☛𝙶𝚘𝚘𝚐𝚕𝚎
║  ❖☛𝙶𝚒𝚖𝚊𝚐𝚎
║  ❖☛𝙻𝚢𝚛𝚒𝚌𝚜
╚══━━━════───➳
╔═━━━━━━━━════─━━━━──➳
║ʜᴇʏ ${m.pushName} ᴋᴇᴇᴘ ᴜsɪɴɢ
╚══━━━━━━━════─━━━━──➳
╔═━━━━━━━════──━━━─➳
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║©ʜᴀɴs-ᴍᴅ-ᴍᴀᴅᴇ ɪɴ ᴛᴀɴᴢᴀɴɪᴀ
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
║ ▄❖▄❖▄❖▄❖▄❖▄❖▄❖▄
╚══━━━━━━════─━━━──➳
╔═━━━━━━━━━━━━════─━━━━━━━━──➳
║  ⚡ᴘᴏᴡᴇʀғᴜʟʟ ʙᴏᴛ ɪɴ 2025 ɴᴇᴡ ᴜᴘᴅᴀᴛᴇ⚡
╚══━━━━━━━━━━━════─━━━━━━━━──➳
`;
            }),
            header: proto.Message.InteractiveMessage.Header.create({
              ...(await prepareWAMessageMedia({
                image: {
                  url: 'https://files.catbox.moe/huyw9t.jpg',
                  
    sock.sendMessage(m.from, { text }, { quoted: m });
  }
}

export default ping;
